Revit 2027 API
ParameterTypeId.SweepBaseVertOffset Property
 "Vertical Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SweepBaseVertOffset { get; }
Public Shared ReadOnly Property SweepBaseVertOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SweepBaseVertOffset {
	ForgeTypeId^ get ();
}
static member SweepBaseVertOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace